public class gamego {
  // Человеку предлагают 3 варианта в консоли либо ознакомиться с правилами либо приглашение на саму игру "начать игру"
  // или "выход"

  // Если человек выберает 1 вариант, ему дают историю и правила игры (обобщённо об игре)

  // Если человек выберает 2 вариант, (дают 3 варианта доски 19-19, 13-13, 9-9) старт игры

  // При старте даётся поле 9-9

  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+
  //|   |   |   |   |   |   |   |   |
  //+---+---+---+---+---+---+---+---+


  // И предлогается начать игру игрок "1" ходит черными фишками а игрок "2" белыми

  // *Как программе понять что фишку одного игрока захватили
  // *Подщёд баллов в конце игры
  // *Как будет работать поле го

  // Valeriy - Лицензия, Readme, меню действий в Main
  // Vadim - 1 командой в мэйне (история и правила игры то есть инфа о игре), посмотрю код "крестики нолики"

  // Vadim - класс Go в котором будет функционал игры
  public static void main(String[] args) {

  }
}
