public class gamego {
  // -Человеку предлагают 3 варианта, в консоли, либо ознакомиться с правилами и самой игрой, либо приглашение на игру
  // "начать игру" или "выход".

  //   -Если человек выбирает 1 вариант, ему дают историю и правила игры (обобщённо об игре).

  //   -Если человек выбирает 2 вариант, (в идеале ему дают 3 основных варианта доски и вариант доски с таким размером
  //   который он сам игрок хочет, не идеальный сценарий дают 3 варианта доски 19-19, 13-13, 9-9),
  //   и после этого старт игры старт игры.
  //     -При старте даётся поле 9-9

  //    a     b     c     d     e     f     g     h     j
  // 1  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 2  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 3  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 4  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 5  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 6  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 7  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 8  +-----+-----+-----+-----+-----+-----+-----+-----+
  //    |     |     |     |     |     |     |     |     |
  // 9  +-----+-----+-----+-----+-----+-----+-----+-----+

  //     -И предлагается начать игру игрок "1" ходит первый черными фишками а игрок "2" белыми (игра происходит на одном устройстве)
  //     Игра предупреждает что игроки должны выбрать за кого играют
  //     И сразу после этого говорит "Введите поле на которое хотите поставить камень"
  //     После игра говорит что ход белых и также "Введите поле на которое хотите поставить камень"
  //     В том случаи если игрок пытается поставить камень в то место где у него нет дыханий игра предупреждает что такой ход не возможен
  //     По ходу действия программы у пользователя всегда есть возможность выйти а по ходу игры он всегда или с определённого момента может всегда сделать "пас"
  //     В конце игра подсчитывает кол. баллов и говорит кто победил.

  //   -Если человек выбирает 3 вариант, он выходит из игры.

  // *Как программе понять что фишк(у;и) одного игрока захватили
  // *Подсчёт баллов в конце игры
  // *Как будет работать поле го

  // Valeriy - Лицензия, Readme, меню действий в Main
  // Vadim - 1 командой в мэйне (история и правила игры то есть инфа о игре), посмотреть код "крестики нолики"

  // Vadim - класс Go в котором будет функционал игры
  public static void main(String[] args) {

  }
}
